<a href="https://colab.research.google.com/github/igorvojnyak/datavojnyak.github.io/blob/master/Test%20Task%20for%20Code%20Reviewers%20in%20DA/DS%20.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [15]:
import numpy as np
import pandas as pd

In [17]:
event_data = pd.read_csv('/content/event_data.csv')
games = pd.read_csv('/content/games.csv')
movie_metadata = pd.read_csv('/content/movie_metadata.csv')

Task 1. Working with data

In [19]:
#The duration column contains data on the film length. How many missing values are there in this column? 
movie_metadata['duration'].isna().sum()

15

In [ ]:
movie_metadata['duration'].median()

103.0

In [24]:
# missing values in the duration column with the median value for this column. 
movie_metadata['duration'].fillna(movie_metadata['duration'].median(),inplace = True)

In [25]:
movie_metadata['duration']

0       178.0
1       169.0
2       148.0
3       164.0
4       103.0
        ...
5038     87.0
5039     43.0
5040     76.0
5041    100.0
5042     90.0
Name: duration, Length: 5043, dtype: float64

In [20]:
print('average film length', round(movie_metadata['duration'].mean(),2))

average film length 107.2

In [26]:
# movie_duration_category column, which will contain three categories depending on the film length
movie_metadata['movie_duration_category'] = movie_metadata['duration'].map(lambda x:'<90' if x<=90 else \
                                                                           ('90–120' if 90 < x <=120 else \
                                                                           ('>120' if x> 120 else \
                                                                            'No Category')))

In [27]:
movie_metadata[['movie_duration_category','duration']]

     movie_duration_category  duration
0                       >120     178.0
1                       >120     169.0
2                       >120     148.0
3                       >120     164.0
4                     90–120     103.0
...                      ...       ...
5038                     <90      87.0
5039                     <90      43.0
5040                     <90      76.0
5041                  90–120     100.0
5042                     <90      90.0

[5043 rows x 2 columns]

In [28]:
# a summary table for films released after 2000 (inclusively), to list the numbers of films: 
df = pd.DataFrame(movie_metadata['movie_duration_category'], index =movie_metadata['title_year'].dropna(axis=0).astype(np.int64)).reset_index()  
df

      title_year movie_duration_category
0           2009                     <90
1           2007                    >120
2           2015                  90–120
3           2012                    >120
4           2012                    >120
...          ...                     ...
4930        2011                    >120
4931        2013                    >120
4932        2013                    >120
4933        2012                    >120
4934        2004                    >120

[4935 rows x 2 columns]

In [ ]:
print('films between 90 minutes and two hours in 2008 = ', df[(df.title_year == 2008) & (df.movie_duration_category == '90–120')].count()["title_year"])

films between 90 minutes and two hours in 2008 =  225

In [29]:
#a column called movie_plot_category, to contain four categories depending on the key words in the column
movie_metadata['movie_plot_category']  = np.where(movie_metadata['plot_keywords'].str.contains("NaN"), 'NaN',
                                                np.where(movie_metadata['plot_keywords'].str.contains("love"), 'love',
                                                np.where(movie_metadata['plot_keywords'].str.contains("death"), 'death',
                                                np.where((movie_metadata['plot_keywords'].str.contains("love") & (movie_metadata['plot_keywords'].str.contains("death"))), 'love_and_death','other'))))

In [30]:
movie_metadata['plot_keywords']

0                  avatar|future|marine|native|paraplegic
1       goddess|marriage ceremony|marriage proposal|pi...
2                     bomb|espionage|sequel|spy|terrorist
3       deception|imprisonment|lawlessness|police offi...
4                                                     NaN
                              ...
5038               fraud|postal worker|prison|theft|trial
5039         cult|fbi|hideout|prison escape|serial killer
5040                                                  NaN
5041                                                  NaN
5042    actress name in title|crush|date|four word tit...
Name: plot_keywords, Length: 5043, dtype: object

In [31]:
movie_metadata['movie_plot_category'].head(50)

0     other
1     other
2     other
3     other
4       NaN
5     other
6     other
7     other
8     other
9      love
10    other
11    other
12    other
13    other
14    other
15    other
16    other
17    other
18    other
19    other
20    other
21    other
22    other
23    other
24    other
25    other
26     love
27    other
28    other
29    other
30    other
31    death
32    other
33    other
34    other
35    other
36    other
37    other
38    other
39    death
40    other
41    other
42    other
43    other
44    death
45    other
46    other
47    other
48    other
49    other
Name: movie_plot_category, dtype: object

In [32]:
movie_metadata[movie_metadata.movie_plot_category == 'death'].count()["plot_keywords"]

172

In [33]:
movie_metadata['imdb_score']

0       7.9
1       7.1
2       6.8
3       8.5
4       7.1
       ...
5038    7.7
5039    7.5
5040    6.3
5041    6.3
5042    6.6
Name: imdb_score, Length: 5043, dtype: float64

In [288]:
#average rating of films depending on which movie_plot_category category they belong to
group = movie_metadata.groupby('movie_plot_category')
print(group['imdb_score'].agg(np.mean))

movie_plot_category
NaN      6.092810
death    6.535465
love     6.576000
other    6.443017
Name: imdb_score, dtype: float64

In [34]:
movie_metadata['budget'] = movie_metadata['budget'].str.replace('$', '')

In [35]:
movie_metadata['budget']= movie_metadata['budget'].astype(float)
movie_metadata['budget']

0       237000000.0
1       300000000.0
2       245000000.0
3       250000000.0
4               0.0
           ...
5038            0.0
5039            0.0
5040         1400.0
5041            0.0
5042         1100.0
Name: budget, Length: 5043, dtype: float64

In [ ]:
# the median budget for all the films listed
int(movie_metadata['budget'].median())

15000000

In [ ]:
print(' median budget for all the films ', int(movie_metadata['budget'].median()))

 median budget for all the films  15000000

Task 2. Problem solving

In [ ]:
event_data = pd.read_csv('/content/event_data.csv')
event_data

      user_id           event_date    event_type  purchase_amount
0      c40e6a  2019-07-29 00:02:15  registration              NaN
1      a2b682  2019-07-29 00:04:46  registration              NaN
2      9ac888  2019-07-29 00:13:22  registration              NaN
3      93ff22  2019-07-29 00:16:47  registration              NaN
4      65ef85  2019-07-29 00:19:23  registration              NaN
...       ...                  ...           ...              ...
79737  930c23  2019-09-01 23:57:41  simple_event              NaN
79738  a84999  2019-09-01 23:57:50  simple_event              NaN
79739  175e4d  2019-09-01 23:59:40  simple_event              NaN
79740  1c2210  2019-09-01 23:59:51  simple_event              NaN
79741  d799dc  2019-09-01 23:59:54  simple_event              NaN

[79742 rows x 4 columns]

In [36]:
event_data['event_date']= pd.to_datetime(event_data['event_date'])

In [38]:
#Highlight user cohorts based on the week of registration in the application
event_data['order_month'] = event_data['event_date'].dt.to_period('W')
event_data['cohort'] = event_data.groupby('user_id')['event_date'] \
                 .transform('min') \
                 .dt.to_period('W')

In [39]:
event_data['cohort']

0        2019-07-29/2019-08-04
1        2019-07-29/2019-08-04
2        2019-07-29/2019-08-04
3        2019-07-29/2019-08-04
4        2019-07-29/2019-08-04
                 ...
79737    2019-08-05/2019-08-11
79738    2019-08-12/2019-08-18
79739    2019-08-05/2019-08-11
79740    2019-08-12/2019-08-18
79741    2019-08-26/2019-09-01
Name: cohort, Length: 79742, dtype: period[W-SUN]

In [40]:
 cohorot=event_data['cohort'].dt.week

In [41]:
print(' cohorts based on the week \n',event_data['cohort'].dt.week)

 cohorts based on the week
 0        31
1        31
2        31
3        31
4        31
         ..
79737    32
79738    33
79739    32
79740    33
79741    35
Name: cohort, Length: 79742, dtype: int64

In [42]:
# unique users in the cohort with ID 33
(event_data['cohort'].dt.week == 33).sum()

18967

In [43]:
#For each event, highlight the indicator lifetime - the weekly lifetime of the cohort. The lifetime indicator is calculated based on the serial number of the week in which the event is committed, relative to the week of registration. 
grouped = event_data.groupby(['cohort', 'order_month'])
cohorts = grouped.agg({'user_id': pd.Series.nunique,
                       'event_type': pd.Series.nunique,
                       'purchase_amount': np.sum})

In [44]:
def cohort_period(event_data):
    event_data['Cohort_lifetime'] = np.arange(len(event_data)) + 1
    return event_data

cohorts = cohorts.groupby(level=0).apply(cohort_period)
cohorts.head(10)

                                             user_id  ...  Cohort_lifetime
cohort                order_month                     ...
2019-07-29/2019-08-04 2019-07-29/2019-08-04     1975  ...                1
                      2019-08-05/2019-08-11     1832  ...                2
                      2019-08-12/2019-08-18     1243  ...                3
                      2019-08-19/2019-08-25      705  ...                4
                      2019-08-26/2019-09-01      297  ...                5
2019-08-05/2019-08-11 2019-08-05/2019-08-11     1952  ...                1
                      2019-08-12/2019-08-18     1814  ...                2
                      2019-08-19/2019-08-25     1265  ...                3
                      2019-08-26/2019-09-01      705  ...                4
2019-08-12/2019-08-18 2019-08-12/2019-08-18     2045  ...                1

[10 rows x 4 columns]

In [45]:
cohorts.reset_index(inplace=True)
cohorts.set_index(['cohort', 'Cohort_lifetime'], inplace=True)
cohort_group_size = cohorts['user_id'].groupby(level=0).first()
cohort_group_size.head()

cohort
2019-07-29/2019-08-04    1975
2019-08-05/2019-08-11    1952
2019-08-12/2019-08-18    2045
2019-08-19/2019-08-25    1974
2019-08-26/2019-09-01    2050
Freq: W-SUN, Name: user_id, dtype: int64

In [ ]:
#e Retention Rate for cohorts depending on lifetime
retention_rate = cohorts['user_id'].unstack(0).divide(cohort_group_size, axis=1)
retention_rate

cohort           2019-07-29/2019-08-04  ...  2019-08-26/2019-09-01
Cohort_lifetime                         ...
1                             1.000000  ...                    1.0
2                             0.927595  ...                    NaN
3                             0.629367  ...                    NaN
4                             0.356962  ...                    NaN
5                             0.150380  ...                    NaN

[5 rows x 5 columns]

In [46]:
pur=event_data.groupby(['user_id', 'order_month'])['purchase_amount'].sum().astype(int).reset_index()
pur

      user_id            order_month  purchase_amount
0      00049f  2019-08-12/2019-08-18               10
1      00049f  2019-08-19/2019-08-25                0
2      00049f  2019-08-26/2019-09-01                0
3      0005f9  2019-08-26/2019-09-01                0
4      00082c  2019-07-29/2019-08-04                0
...       ...                    ...              ...
22928  fff22e  2019-08-26/2019-09-01                0
22929  fff4aa  2019-08-05/2019-08-11                0
22930  fff4aa  2019-08-12/2019-08-18                0
22931  fff4aa  2019-08-19/2019-08-25               20
22932  fff4aa  2019-08-26/2019-09-01                0

[22933 rows x 3 columns]

In [47]:
tx_retention = pd.crosstab(pur['user_id'], pur['order_month']).reset_index()
tx_retention

order_month user_id  ...  2019-08-26/2019-09-01
0            00049f  ...                      1
1            0005f9  ...                      1
2            00082c  ...                      0
3            000ff1  ...                      1
4            001d5d  ...                      1
...             ...  ...                    ...
9991         ffe1a7  ...                      0
9992         ffe60a  ...                      1
9993         fff039  ...                      1
9994         fff22e  ...                      1
9995         fff4aa  ...                      1

[9996 rows x 6 columns]

Task 3. Solve the problem (optional)

In [ ]:
games = pd.read_csv('/content/games.csv')

In [ ]:
games=games[games['Year_of_Release']>2000]
games

                          Name Platform  ...  User_Score Rating
0                   Wii Sports      Wii  ...           8      E
2               Mario Kart Wii      Wii  ...         8.3      E
3            Wii Sports Resort      Wii  ...           8      E
6        New Super Mario Bros.       DS  ...         8.5      E
7                     Wii Play      Wii  ...         6.6      E
...                        ...      ...  ...         ...    ...
16699          Planet Monsters      GBA  ...         tbd      E
16700                   Breach       PC  ...         5.8      T
16701         Bust-A-Move 3000       GC  ...         tbd      E
16702         Mega Brain Boost       DS  ...         tbd      E
16706  STORM: Frontline Nation       PC  ...         7.2   E10+

[7651 rows x 7 columns]

Task 4.

In [ ]:
E(X) = 0.5
Var(X) = 2 
 
E(Y) = 7
Var(Y) = 3.5 
 
cov(X, Y) = -0.8

In [ ]:
#the variance of the random variable Z = 2X - 3Y 
Var(2X-3Y)=4Var(X)+9Var(Y)-2*2*3Cov(X,Y) = 16+110.25+9.6=135.85

Task 5.

In [49]:
summation_error = 0
difference = 0.5 
squared_difference = difference**2  
summation_error = summation_error + squared_difference  
MSE = summation/400 
print("The Mean Square Error for model is: " , MSE)

The Mean Square Error for model is:  0.0036

In [50]:
summation_error = 0
difference = 0.7 
squared_difference = difference**2  
summation_error = summation_error + squared_difference  
MSE = summation_error/100 
print("The Mean Square Error for model is: " , MSE)

The Mean Square Error for model is:  0.004899999999999999

In [52]:
summation_error = 0
difference = 1.2
squared_difference = difference**2  
summation_error = summation_error + squared_difference  
MSE = summation_error/500
print("The Mean Square Error for Omer's model is: " , MSE)

The Mean Square Error for Omer's model is:  0.0028799999999999997

In [54]:

accumulated_error = (1.2)**2
mae_error = (1.0 / (2*500)) * accumulated_error
    
print("The Mean Square Error for his  Limor's  model is: ",mae_error)

The Mean Square Error for his  Limor's  model is:  0.0014399999999999999